Картриджи/src/Documents/Списание/Списание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Списание</name>
  <registerRecords>AccumulationRegister.ОстаткиКартриджей</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретСоздания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Картриджи</name>
    <attributes>
      <name>Картриджи</name>
      <type>
        <types>CatalogRef.МоделиКартриджей</types>
      </type>
    </attributes>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>CatalogRef.Производители</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Картриджи/src/AccumulationRegisters/ОстаткиКартриджей/ОстаткиКартриджей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиКартриджей</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Картридж</name>
    <type>
      <types>CatalogRef.МоделиКартриджей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделения</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Картриджи/src/Documents/Списание/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроведениеПоРегистрам(Отказ, Режим);
		
КонецПроцедуры

Процедура ПроведениеПоРегистрам(Отказ, Режим)
	
	РегистрОстаткиКартриджей(Отказ, Режим);
		
КонецПроцедуры

//Процедуры непосредственной работы с регистрами:
Процедура РегистрОстаткиКартриджей(Отказ, Режим)
	
	//регистр ОстаткиКартриджей Расход
	Движения.ОстаткиКартриджей.Записывать = Истина;
	Движения.ОстаткиКартриджей.Очистить();
	
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда
		
		Движения.ОстаткиКартриджей.БлокироватьДляИзменения = Истина;
		Движения.ОстаткиКартриджей.Записать();
		
	КонецЕсли;
	
	Для Каждого ТекСтрокаКартриджи Из Картриджи Цикл  		
		
		Движение = Движения.ОстаткиКартриджей.Добавить();
		Движение.ВидДвижения   = ВидДвиженияНакопления.Расход;
		Движение.Период        = Дата;
		Движение.Картридж      = ТекСтрокаКартриджи.Картриджи;
		Движение.Количество    = ТекСтрокаКартриджи.Количество;
		Движение.Подразделения = Подразделение;		
		
	КонецЦикла;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОстаткиКартриджейОстатки.Картридж КАК Картридж,
	               |	ОстаткиКартриджейОстатки.Подразделения КАК Подразделение,
	               |	ОстаткиКартриджейОстатки.КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ОстаткиКартриджей.Остатки(
	               |			&МоментВремени,
	               |			(Картридж, Подразделения) В
	               |				(ВЫБРАТЬ
	               |					СписаниеКартриджи.Картриджи,
	               |					СписаниеКартриджи.Ссылка.Подразделение
	               |				ИЗ
	               |					Документ.Списание.Картриджи КАК СписаниеКартриджи
	               |				ГДЕ
	               |					СписаниеКартриджи.Ссылка = &Ссылка)) КАК ОстаткиКартриджейОстатки
	               |ГДЕ
	               |	ОстаткиКартриджейОстатки.КоличествоОстаток < 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Картридж
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени(), ВидГраницы.Включая));			   
	Запрос.УстановитьПараметр("Ссылка"       , Ссылка);			   
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Сообщить("В подразделении: " 
			+ Выборка.Подразделение 
			+ ", для картриджа: " 
			+ Выборка.Картридж 
			+ ",не хвататет количества: " 
			+ Строка(-Выборка.КоличествоОстаток) 
			+ " шт..",СтатусСообщения.Важное);		
			
			Отказ = Истина;
			
		КонецЦикла;	
	
	КонецЕсли;
	
КонецПроцедуры
